Autodesk.Revit.Exceptions.ArgumentsInconsistentException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ArgumentsInconsistentException
The exception that is thrown when each individual argument is OK, but a joint constraint is violated.